##
# Homebrew bundle manifest
##

##
# Taps
##

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

##
# Formulae
#
# Some of these suckers are installed on MacOS by default, but are
# reinstalled to provide the most recent version and management
# via Homebrew.
##

brew "antibody"
brew "automake"
brew "awk"
brew "base64"
brew "bash-completion"
brew "bcrypt"
brew "cloc"
brew "composer"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "dnsmasq", restart_service: true
brew "duti"
brew "fzf"
brew "gawk"
brew "git"
brew "go"
brew "gzip"
brew "imagemagick"
brew "make"
brew "mas"
brew "mysql", restart_service: true
brew "nano"
brew "nginx", restart_service: true
brew "node"
brew "nvm"
brew "openssl"
brew "p7zip"
brew "php", restart_service: true
brew "pkg-config"
brew "python"
brew "python3"
brew "rbenv"
brew "redis"
brew "rsync"
brew "subversion"
brew "thefuck"
brew "tldr"
brew "tree"
brew "unar"
brew "unzip"
brew "wget"
brew "wp-cli"
brew "yarn"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# order is important
cask "xquartz"
brew "xclip"
brew "pandoc", link: true
brew "shellcheck"

##
# Casks : apps
##

cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "alfred"
cask "bartender"
cask "discord"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox"
cask "fork"
cask "google-chrome"
cask "gpg-suite"
cask "imageoptim"
cask "insomnia"
cask "iterm2"
cask "kid3"
cask "logitech-options"
cask "meld"
cask "sequel-ace"
cask "sketch"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "transmission"
cask "typora"
cask "vlc"

##
# Casks : fonts
##

cask 'font-abril-fatface'
cask 'font-archivo-black'
cask 'font-archivo-narrow'
cask 'font-arvo'
cask 'font-awesome-terminal-fonts'
cask 'font-bitter'
cask 'font-cabin'
cask 'font-cabin-sketch'
cask 'font-courier-prime'
cask 'font-dashicons'
cask 'font-devicons'
cask 'font-domine'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-fira-code'
cask 'font-fontawesome'
cask 'font-foundation-icons'
cask 'font-icomoon'
cask 'font-impact'
cask 'font-inconsolata'
cask 'font-ionicons'
cask 'font-karla'
cask 'font-lato'
cask 'font-libre-baskerville'
cask 'font-libre-franklin'
cask 'font-material-icons'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-oswald'
cask 'font-playfair-display'
cask 'font-poppins'
cask 'font-pt-mono'
cask 'font-pt-sans'
cask 'font-pt-serif'
cask 'font-racing-sans-one'
cask 'font-raleway'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-roboto-slab'
cask 'font-rubik'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-ubuntu'
cask 'font-work-sans'
cask 'font-yellowtail'

##
# App Store apps
##

mas "Capo", id: 696977615
mas "GarageBand", id: 682658836
mas "Harvest", id: 506189836
mas "Logic Pro X", id: 634148309
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
